PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.5 *
       3;* Date/Time created: Sat Jul  3 21:31:23 2021                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.5 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/BBAI-SHARED-MEM/pru_codes")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_PRU_DMEM_0_1
      15        .global __PRU_CREG_PRU_DMEM_1_0
      16
      17$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("atoi")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("atoi")
      19        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)
      20        .dwattr $C$DW$1, DW_AT_declaration

     784        .dwattr $C$DW$54, DW_AT_TI_begin_line(0x92)
     785        .dwattr $C$DW$54, DW_AT_TI_begin_column(0x06)
     786        .dwattr $C$DW$54, DW_AT_decl_file("main.c")
     787        .dwattr $C$DW$54, DW_AT_decl_line(0x92)
     788        .dwattr $C$DW$54, DW_AT_decl_column(0x06)
     789        .dwattr $C$DW$54, DW_AT_TI_max_frame_size(0x02)
     790        .dwpsn  file "main.c",line 146,column 17,is_stmt,address ||main||,isa 0
     791
     792        .dwfde $C$DW$CIE, ||main||
     793;----------------------------------------------------------------------
     794; 146 | void main(void) {                                                      
     795;----------------------------------------------------------------------
     796
     797;***************************************************************
     798;* FNAME: main                          FR SIZE:   2           *
     799;*                                                             *
     800;* FUNCTION ENVIRONMENT                                        *
     801;*                                                             *
     802;* FUNCTION PROPERTIES                                         *
     803;*                            0 Auto,  2 SOE     *
     804;***************************************************************
     805
     806 00000000                 ||main||:
     807;* --------------------------------------------------------------------------*
     808        .dwcfi  cfa_offset, 0
     809;***    ; the preceding call never returns
     810 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     811        .dwcfi  cfa_offset, 2
     812 00000004 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     813        .dwcfi  save_reg_to_mem, 14, -2
     814        .dwcfi  save_reg_to_mem, 15, -1
     815        .dwpsn  file "main.c",line 147,column 3,is_stmt,isa 0
     816;----------------------------------------------------------------------
     817; 147 | pru_function(1);                                                       
     818;----------------------------------------------------------------------
     819$C$DW$55        .dwtag  DW_TAG_TI_branch
     820        .dwattr $C$DW$55, DW_AT_low_pc(0x00)
     821        .dwattr $C$DW$55, DW_AT_name("pru_function")
     822        .dwattr $C$DW$55, DW_AT_TI_call
     823 00000008 000000230000C3!         JAL       r3.w2, ||pru_function|| ; [ALU_PRU] |147| pru_function
     824 0000000c 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     825        .dwcfi  restore_reg, 14
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   16

     826        .dwcfi  restore_reg, 15
     827 00000010 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     828        .dwcfi  cfa_offset, 0
     829$C$DW$56        .dwtag  DW_TAG_TI_branch
     830        .dwattr $C$DW$56, DW_AT_low_pc(0x00)
     831        .dwattr $C$DW$56, DW_AT_TI_return
     832 00000014 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     833        .dwattr $C$DW$54, DW_AT_TI_end_file("main.c")
     834        .dwattr $C$DW$54, DW_AT_TI_end_line(0x94)
     835        .dwattr $C$DW$54, DW_AT_TI_end_column(0x01)
     836        .dwendentry
     837        .dwendtag $C$DW$54
     838
     839;******************************************************************************
     840;* STRINGS                                                                    *
     841;******************************************************************************
     842 00000000                         .sect   ".rodata:.string"
     843 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
     844 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 30",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000030 
         00000014 00000000000000 
     845;*****************************************************************************
     846;* UNDEFINED EXTERNAL REFERENCES                                             *
     847;*****************************************************************************
     848        .global ||atoi||
     849        .global ||pru_rpmsg_init||
     850        .global ||pru_rpmsg_receive||
     851        .global ||pru_rpmsg_send||
     852        .global ||pru_rpmsg_channel||
     853
     854;******************************************************************************
     855;* TYPE INFORMATION                                                           *
     856;******************************************************************************
     857
     858$C$DW$T$19      .dwtag  DW_TAG_structure_type
     859        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     860$C$DW$57        .dwtag  DW_TAG_member
     861        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   17

     862        .dwattr $C$DW$57, DW_AT_name("REVISION")
     863        .dwattr $C$DW$57, DW_AT_TI_symbol_name("REVISION")
     864        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     865        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     867        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     868        .dwattr $C$DW$57, DW_AT_decl_line(0x2d)
     869        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     870        .dwendtag $C$DW$T$19
     871
     872        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
     873        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     874        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     875$C$DW$T$113     .dwtag  DW_TAG_volatile_type
     876        .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$19)
     877
     878$C$DW$T$20      .dwtag  DW_TAG_structure_type
     879        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     880$C$DW$58        .dwtag  DW_TAG_member
     881        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     882        .dwattr $C$DW$58, DW_AT_name("IDLE_MODE")
     883        .dwattr $C$DW$58, DW_AT_TI_symbol_name("IDLE_MODE")
     884        .dwattr $C$DW$58, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     885        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     887        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     888        .dwattr $C$DW$58, DW_AT_decl_line(0x37)
     889        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     890$C$DW$59        .dwtag  DW_TAG_member
     891        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     892        .dwattr $C$DW$59, DW_AT_name("STANDBY_MODE")
     893        .dwattr $C$DW$59, DW_AT_TI_symbol_name("STANDBY_MODE")
     894        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     895        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     897        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     898        .dwattr $C$DW$59, DW_AT_decl_line(0x38)
     899        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     900$C$DW$60        .dwtag  DW_TAG_member
     901        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     902        .dwattr $C$DW$60, DW_AT_name("STANDBY_INIT")
     903        .dwattr $C$DW$60, DW_AT_TI_symbol_name("STANDBY_INIT")
     904        .dwattr $C$DW$60, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     905        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     907        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     908        .dwattr $C$DW$60, DW_AT_decl_line(0x39)
     909        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     910$C$DW$61        .dwtag  DW_TAG_member
     911        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     912        .dwattr $C$DW$61, DW_AT_name("SUB_MWAIT")
     913        .dwattr $C$DW$61, DW_AT_TI_symbol_name("SUB_MWAIT")
     914        .dwattr $C$DW$61, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     915        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   18

     917        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     918        .dwattr $C$DW$61, DW_AT_decl_line(0x3a)
     919        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     920$C$DW$62        .dwtag  DW_TAG_member
     921        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     922        .dwattr $C$DW$62, DW_AT_name("rsvd6")
     923        .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd6")
     924        .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     925        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     927        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     928        .dwattr $C$DW$62, DW_AT_decl_line(0x3b)
     929        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     930        .dwendtag $C$DW$T$20
     931
     932        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
     933        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     934        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     935$C$DW$T$115     .dwtag  DW_TAG_volatile_type
     936        .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$20)
     937
     938$C$DW$T$21      .dwtag  DW_TAG_structure_type
     939        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     940$C$DW$63        .dwtag  DW_TAG_member
     941        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     942        .dwattr $C$DW$63, DW_AT_name("PRU0_GPI_MODE")
     943        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     944        .dwattr $C$DW$63, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     945        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     947        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     948        .dwattr $C$DW$63, DW_AT_decl_line(0x45)
     949        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     950$C$DW$64        .dwtag  DW_TAG_member
     951        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     952        .dwattr $C$DW$64, DW_AT_name("PRU0_GPI_CLK_MODE")
     953        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     954        .dwattr $C$DW$64, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     955        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     957        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     958        .dwattr $C$DW$64, DW_AT_decl_line(0x46)
     959        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     960$C$DW$65        .dwtag  DW_TAG_member
     961        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     962        .dwattr $C$DW$65, DW_AT_name("PRU0_GPI_DIV0")
     963        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     964        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     965        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     967        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     968        .dwattr $C$DW$65, DW_AT_decl_line(0x47)
     969        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     970$C$DW$66        .dwtag  DW_TAG_member
     971        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   19

     972        .dwattr $C$DW$66, DW_AT_name("PRU0_GPI_DIV1")
     973        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     974        .dwattr $C$DW$66, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     975        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     977        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     978        .dwattr $C$DW$66, DW_AT_decl_line(0x48)
     979        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     980$C$DW$67        .dwtag  DW_TAG_member
     981        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     982        .dwattr $C$DW$67, DW_AT_name("PRU0_GPI_SB")
     983        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     984        .dwattr $C$DW$67, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     985        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     987        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     988        .dwattr $C$DW$67, DW_AT_decl_line(0x49)
     989        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     990$C$DW$68        .dwtag  DW_TAG_member
     991        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     992        .dwattr $C$DW$68, DW_AT_name("PRU0_GPO_MODE")
     993        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     994        .dwattr $C$DW$68, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     995        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     997        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
     998        .dwattr $C$DW$68, DW_AT_decl_line(0x4a)
     999        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1000$C$DW$69        .dwtag  DW_TAG_member
    1001        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1002        .dwattr $C$DW$69, DW_AT_name("PRU0_GPO_DIV0")
    1003        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1004        .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1005        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1007        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1008        .dwattr $C$DW$69, DW_AT_decl_line(0x4b)
    1009        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1010$C$DW$70        .dwtag  DW_TAG_member
    1011        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1012        .dwattr $C$DW$70, DW_AT_name("PRU0_GPO_DIV1")
    1013        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1014        .dwattr $C$DW$70, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1015        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1017        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1018        .dwattr $C$DW$70, DW_AT_decl_line(0x4c)
    1019        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1020$C$DW$71        .dwtag  DW_TAG_member
    1021        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1022        .dwattr $C$DW$71, DW_AT_name("PRU0_GPO_SH_SEL")
    1023        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1024        .dwattr $C$DW$71, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1025        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   20

    1027        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1028        .dwattr $C$DW$71, DW_AT_decl_line(0x4d)
    1029        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1030$C$DW$72        .dwtag  DW_TAG_member
    1031        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1032        .dwattr $C$DW$72, DW_AT_name("PR1_PRU0_GP_MUX_SEL")
    1033        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PR1_PRU0_GP_MUX_SEL")
    1034        .dwattr $C$DW$72, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x04)
    1035        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1037        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1038        .dwattr $C$DW$72, DW_AT_decl_line(0x4e)
    1039        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1040$C$DW$73        .dwtag  DW_TAG_member
    1041        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1042        .dwattr $C$DW$73, DW_AT_name("rsvd26")
    1043        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd26")
    1044        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1045        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1047        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1048        .dwattr $C$DW$73, DW_AT_decl_line(0x4f)
    1049        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1050        .dwendtag $C$DW$T$21
    1051
    1052        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1053        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1054        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1055$C$DW$T$117     .dwtag  DW_TAG_volatile_type
    1056        .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$21)
    1057
    1058$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1059        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1060$C$DW$74        .dwtag  DW_TAG_member
    1061        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1062        .dwattr $C$DW$74, DW_AT_name("PRU1_GPI_MODE")
    1063        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1064        .dwattr $C$DW$74, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1065        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1067        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1068        .dwattr $C$DW$74, DW_AT_decl_line(0x59)
    1069        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1070$C$DW$75        .dwtag  DW_TAG_member
    1071        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1072        .dwattr $C$DW$75, DW_AT_name("PRU1_GPI_CLK_MODE")
    1073        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1074        .dwattr $C$DW$75, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1075        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1077        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1078        .dwattr $C$DW$75, DW_AT_decl_line(0x5a)
    1079        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1080$C$DW$76        .dwtag  DW_TAG_member
    1081        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   21

    1082        .dwattr $C$DW$76, DW_AT_name("PRU1_GPI_DIV0")
    1083        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1084        .dwattr $C$DW$76, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1085        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1087        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1088        .dwattr $C$DW$76, DW_AT_decl_line(0x5b)
    1089        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1090$C$DW$77        .dwtag  DW_TAG_member
    1091        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1092        .dwattr $C$DW$77, DW_AT_name("PRU1_GPI_DIV1")
    1093        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1094        .dwattr $C$DW$77, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1095        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1097        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1098        .dwattr $C$DW$77, DW_AT_decl_line(0x5c)
    1099        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1100$C$DW$78        .dwtag  DW_TAG_member
    1101        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1102        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_SB")
    1103        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1104        .dwattr $C$DW$78, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1105        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1107        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1108        .dwattr $C$DW$78, DW_AT_decl_line(0x5d)
    1109        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1110$C$DW$79        .dwtag  DW_TAG_member
    1111        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1112        .dwattr $C$DW$79, DW_AT_name("PRU1_GPO_MODE")
    1113        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1114        .dwattr $C$DW$79, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1115        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1117        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1118        .dwattr $C$DW$79, DW_AT_decl_line(0x5e)
    1119        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1120$C$DW$80        .dwtag  DW_TAG_member
    1121        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1122        .dwattr $C$DW$80, DW_AT_name("PRU1_GPO_DIV0")
    1123        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1124        .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1125        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1127        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1128        .dwattr $C$DW$80, DW_AT_decl_line(0x5f)
    1129        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1130$C$DW$81        .dwtag  DW_TAG_member
    1131        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1132        .dwattr $C$DW$81, DW_AT_name("PRU1_GPO_DIV1")
    1133        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1134        .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1135        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   22

    1137        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1138        .dwattr $C$DW$81, DW_AT_decl_line(0x60)
    1139        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1140$C$DW$82        .dwtag  DW_TAG_member
    1141        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1142        .dwattr $C$DW$82, DW_AT_name("PRU1_GPO_SH_SEL")
    1143        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1144        .dwattr $C$DW$82, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1145        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1147        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1148        .dwattr $C$DW$82, DW_AT_decl_line(0x61)
    1149        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1150$C$DW$83        .dwtag  DW_TAG_member
    1151        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1152        .dwattr $C$DW$83, DW_AT_name("PR1_PRU1_GP_MUX_SEL")
    1153        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PR1_PRU1_GP_MUX_SEL")
    1154        .dwattr $C$DW$83, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x04)
    1155        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1157        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1158        .dwattr $C$DW$83, DW_AT_decl_line(0x62)
    1159        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1160$C$DW$84        .dwtag  DW_TAG_member
    1161        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1162        .dwattr $C$DW$84, DW_AT_name("rsvd26")
    1163        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd26")
    1164        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1165        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1167        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1168        .dwattr $C$DW$84, DW_AT_decl_line(0x63)
    1169        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1170        .dwendtag $C$DW$T$22
    1171
    1172        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1173        .dwattr $C$DW$T$22, DW_AT_decl_line(0x58)
    1174        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1175$C$DW$T$119     .dwtag  DW_TAG_volatile_type
    1176        .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$22)
    1177
    1178$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1179        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1180$C$DW$85        .dwtag  DW_TAG_member
    1181        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1182        .dwattr $C$DW$85, DW_AT_name("PRU0_CLK_STOP_REQ")
    1183        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1184        .dwattr $C$DW$85, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1185        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1187        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1188        .dwattr $C$DW$85, DW_AT_decl_line(0x6d)
    1189        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1190$C$DW$86        .dwtag  DW_TAG_member
    1191        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   23

    1192        .dwattr $C$DW$86, DW_AT_name("PRU0_CLK_STOP_ACK")
    1193        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1194        .dwattr $C$DW$86, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1195        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1197        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1198        .dwattr $C$DW$86, DW_AT_decl_line(0x6e)
    1199        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1200$C$DW$87        .dwtag  DW_TAG_member
    1201        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1202        .dwattr $C$DW$87, DW_AT_name("PRU0_CLK_EN")
    1203        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1204        .dwattr $C$DW$87, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1205        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1207        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1208        .dwattr $C$DW$87, DW_AT_decl_line(0x6f)
    1209        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1210$C$DW$88        .dwtag  DW_TAG_member
    1211        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1212        .dwattr $C$DW$88, DW_AT_name("PRU1_CLK_STOP_REQ")
    1213        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1214        .dwattr $C$DW$88, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1215        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1217        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1218        .dwattr $C$DW$88, DW_AT_decl_line(0x70)
    1219        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1220$C$DW$89        .dwtag  DW_TAG_member
    1221        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1222        .dwattr $C$DW$89, DW_AT_name("PRU1_CLK_STOP_ACK")
    1223        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1224        .dwattr $C$DW$89, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1225        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1227        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1228        .dwattr $C$DW$89, DW_AT_decl_line(0x71)
    1229        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1230$C$DW$90        .dwtag  DW_TAG_member
    1231        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1232        .dwattr $C$DW$90, DW_AT_name("PRU1_CLK_EN")
    1233        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1234        .dwattr $C$DW$90, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1235        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1237        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1238        .dwattr $C$DW$90, DW_AT_decl_line(0x72)
    1239        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1240$C$DW$91        .dwtag  DW_TAG_member
    1241        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1242        .dwattr $C$DW$91, DW_AT_name("INTC_CLK_STOP_REQ")
    1243        .dwattr $C$DW$91, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1244        .dwattr $C$DW$91, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1245        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   24

    1247        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1248        .dwattr $C$DW$91, DW_AT_decl_line(0x73)
    1249        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1250$C$DW$92        .dwtag  DW_TAG_member
    1251        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1252        .dwattr $C$DW$92, DW_AT_name("INTC_CLK_STOP_ACK")
    1253        .dwattr $C$DW$92, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1254        .dwattr $C$DW$92, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1255        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1257        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1258        .dwattr $C$DW$92, DW_AT_decl_line(0x74)
    1259        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1260$C$DW$93        .dwtag  DW_TAG_member
    1261        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1262        .dwattr $C$DW$93, DW_AT_name("INTC_CLK_EN")
    1263        .dwattr $C$DW$93, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1264        .dwattr $C$DW$93, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1265        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1267        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1268        .dwattr $C$DW$93, DW_AT_decl_line(0x75)
    1269        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1270$C$DW$94        .dwtag  DW_TAG_member
    1271        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1272        .dwattr $C$DW$94, DW_AT_name("UART_CLK_STOP_REQ")
    1273        .dwattr $C$DW$94, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1274        .dwattr $C$DW$94, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1275        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1277        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1278        .dwattr $C$DW$94, DW_AT_decl_line(0x76)
    1279        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1280$C$DW$95        .dwtag  DW_TAG_member
    1281        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1282        .dwattr $C$DW$95, DW_AT_name("UART_CLK_STOP_ACK")
    1283        .dwattr $C$DW$95, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1284        .dwattr $C$DW$95, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1285        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1287        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1288        .dwattr $C$DW$95, DW_AT_decl_line(0x77)
    1289        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1290$C$DW$96        .dwtag  DW_TAG_member
    1291        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1292        .dwattr $C$DW$96, DW_AT_name("UART_CLK_EN")
    1293        .dwattr $C$DW$96, DW_AT_TI_symbol_name("UART_CLK_EN")
    1294        .dwattr $C$DW$96, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1295        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1297        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1298        .dwattr $C$DW$96, DW_AT_decl_line(0x78)
    1299        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1300$C$DW$97        .dwtag  DW_TAG_member
    1301        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   25

    1302        .dwattr $C$DW$97, DW_AT_name("ECAP_CLK_STOP_REQ")
    1303        .dwattr $C$DW$97, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1304        .dwattr $C$DW$97, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1305        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1307        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1308        .dwattr $C$DW$97, DW_AT_decl_line(0x79)
    1309        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1310$C$DW$98        .dwtag  DW_TAG_member
    1311        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1312        .dwattr $C$DW$98, DW_AT_name("ECAP_CLK_STOP_ACK")
    1313        .dwattr $C$DW$98, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1314        .dwattr $C$DW$98, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1315        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1317        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1318        .dwattr $C$DW$98, DW_AT_decl_line(0x7a)
    1319        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1320$C$DW$99        .dwtag  DW_TAG_member
    1321        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1322        .dwattr $C$DW$99, DW_AT_name("ECAP_CLK_EN")
    1323        .dwattr $C$DW$99, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1324        .dwattr $C$DW$99, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1325        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1327        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_0
    1328        .dwattr $C$DW$99, DW_AT_decl_line(0x7b)
    1329        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1330$C$DW$100       .dwtag  DW_TAG_member
    1331        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1332        .dwattr $C$DW$100, DW_AT_name("IEP_CLK_STOP_REQ")
    1333        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1334        .dwattr $C$DW$100, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1335        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1337        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1338        .dwattr $C$DW$100, DW_AT_decl_line(0x7c)
    1339        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1340$C$DW$101       .dwtag  DW_TAG_member
    1341        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1342        .dwattr $C$DW$101, DW_AT_name("IEP_CLK_STOP_ACK")
    1343        .dwattr $C$DW$101, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1344        .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1345        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1347        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1348        .dwattr $C$DW$101, DW_AT_decl_line(0x7d)
    1349        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1350$C$DW$102       .dwtag  DW_TAG_member
    1351        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1352        .dwattr $C$DW$102, DW_AT_name("IEP_CLK_EN")
    1353        .dwattr $C$DW$102, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1354        .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1355        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   26

    1357        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1358        .dwattr $C$DW$102, DW_AT_decl_line(0x7e)
    1359        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1360$C$DW$103       .dwtag  DW_TAG_member
    1361        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1362        .dwattr $C$DW$103, DW_AT_name("rsvd18")
    1363        .dwattr $C$DW$103, DW_AT_TI_symbol_name("rsvd18")
    1364        .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1365        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1367        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1368        .dwattr $C$DW$103, DW_AT_decl_line(0x7f)
    1369        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1370        .dwendtag $C$DW$T$23
    1371
    1372        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1373        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
    1374        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1375$C$DW$T$121     .dwtag  DW_TAG_volatile_type
    1376        .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$23)
    1377
    1378$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1379        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1380$C$DW$104       .dwtag  DW_TAG_member
    1381        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1382        .dwattr $C$DW$104, DW_AT_name("PRU0_IMEM_PE_RAW")
    1383        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1384        .dwattr $C$DW$104, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1385        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1387        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1388        .dwattr $C$DW$104, DW_AT_decl_line(0x89)
    1389        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1390$C$DW$105       .dwtag  DW_TAG_member
    1391        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1392        .dwattr $C$DW$105, DW_AT_name("PRU0_DMEM_PE_RAW")
    1393        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1394        .dwattr $C$DW$105, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1395        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1397        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1398        .dwattr $C$DW$105, DW_AT_decl_line(0x8a)
    1399        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1400$C$DW$106       .dwtag  DW_TAG_member
    1401        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1402        .dwattr $C$DW$106, DW_AT_name("PRU1_IMEM_PE_RAW")
    1403        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1404        .dwattr $C$DW$106, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1405        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1407        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1408        .dwattr $C$DW$106, DW_AT_decl_line(0x8b)
    1409        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1410$C$DW$107       .dwtag  DW_TAG_member
    1411        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   27

    1412        .dwattr $C$DW$107, DW_AT_name("PRU1_DMEM_PE_RAW")
    1413        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1414        .dwattr $C$DW$107, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1415        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1417        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1418        .dwattr $C$DW$107, DW_AT_decl_line(0x8c)
    1419        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1420$C$DW$108       .dwtag  DW_TAG_member
    1421        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1422        .dwattr $C$DW$108, DW_AT_name("RAM_PE_RAW")
    1423        .dwattr $C$DW$108, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1424        .dwattr $C$DW$108, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1425        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1427        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1428        .dwattr $C$DW$108, DW_AT_decl_line(0x8d)
    1429        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1430$C$DW$109       .dwtag  DW_TAG_member
    1431        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1432        .dwattr $C$DW$109, DW_AT_name("rsvd20")
    1433        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd20")
    1434        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1435        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1437        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1438        .dwattr $C$DW$109, DW_AT_decl_line(0x8e)
    1439        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1440        .dwendtag $C$DW$T$24
    1441
    1442        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1443        .dwattr $C$DW$T$24, DW_AT_decl_line(0x88)
    1444        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1445$C$DW$T$123     .dwtag  DW_TAG_volatile_type
    1446        .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$24)
    1447
    1448$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1449        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1450$C$DW$110       .dwtag  DW_TAG_member
    1451        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1452        .dwattr $C$DW$110, DW_AT_name("PRU0_IMEM_PE")
    1453        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1454        .dwattr $C$DW$110, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1455        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1457        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1458        .dwattr $C$DW$110, DW_AT_decl_line(0x98)
    1459        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1460$C$DW$111       .dwtag  DW_TAG_member
    1461        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1462        .dwattr $C$DW$111, DW_AT_name("PRU0_DMEM_PE")
    1463        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1464        .dwattr $C$DW$111, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1465        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   28

    1467        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1468        .dwattr $C$DW$111, DW_AT_decl_line(0x99)
    1469        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1470$C$DW$112       .dwtag  DW_TAG_member
    1471        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1472        .dwattr $C$DW$112, DW_AT_name("PRU1_IMEM_PE")
    1473        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1474        .dwattr $C$DW$112, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1475        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1478        .dwattr $C$DW$112, DW_AT_decl_line(0x9a)
    1479        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1480$C$DW$113       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1482        .dwattr $C$DW$113, DW_AT_name("PRU1_DMEM_PE")
    1483        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1484        .dwattr $C$DW$113, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1485        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1487        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1488        .dwattr $C$DW$113, DW_AT_decl_line(0x9b)
    1489        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1490$C$DW$114       .dwtag  DW_TAG_member
    1491        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1492        .dwattr $C$DW$114, DW_AT_name("RAM_PE")
    1493        .dwattr $C$DW$114, DW_AT_TI_symbol_name("RAM_PE")
    1494        .dwattr $C$DW$114, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1495        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1497        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1498        .dwattr $C$DW$114, DW_AT_decl_line(0x9c)
    1499        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1500$C$DW$115       .dwtag  DW_TAG_member
    1501        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1502        .dwattr $C$DW$115, DW_AT_name("rsvd20")
    1503        .dwattr $C$DW$115, DW_AT_TI_symbol_name("rsvd20")
    1504        .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1505        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1507        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1508        .dwattr $C$DW$115, DW_AT_decl_line(0x9d)
    1509        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1510        .dwendtag $C$DW$T$25
    1511
    1512        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1513        .dwattr $C$DW$T$25, DW_AT_decl_line(0x97)
    1514        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1515$C$DW$T$125     .dwtag  DW_TAG_volatile_type
    1516        .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$25)
    1517
    1518$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1519        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1520$C$DW$116       .dwtag  DW_TAG_member
    1521        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   29

    1522        .dwattr $C$DW$116, DW_AT_name("PRU0_IMEM_PE_SET")
    1523        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1524        .dwattr $C$DW$116, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1525        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1526        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1527        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1528        .dwattr $C$DW$116, DW_AT_decl_line(0xa6)
    1529        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1530$C$DW$117       .dwtag  DW_TAG_member
    1531        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1532        .dwattr $C$DW$117, DW_AT_name("PRU0_DMEM_PE_SET")
    1533        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1534        .dwattr $C$DW$117, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1535        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1537        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1538        .dwattr $C$DW$117, DW_AT_decl_line(0xa7)
    1539        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1540$C$DW$118       .dwtag  DW_TAG_member
    1541        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1542        .dwattr $C$DW$118, DW_AT_name("PRU1_IMEM_PE_SET")
    1543        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1544        .dwattr $C$DW$118, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1545        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1547        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1548        .dwattr $C$DW$118, DW_AT_decl_line(0xa8)
    1549        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1550$C$DW$119       .dwtag  DW_TAG_member
    1551        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1552        .dwattr $C$DW$119, DW_AT_name("PRU1_DMEM_PE_SET")
    1553        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1554        .dwattr $C$DW$119, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1555        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1557        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1558        .dwattr $C$DW$119, DW_AT_decl_line(0xa9)
    1559        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1560$C$DW$120       .dwtag  DW_TAG_member
    1561        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1562        .dwattr $C$DW$120, DW_AT_name("RAM_PE_SET")
    1563        .dwattr $C$DW$120, DW_AT_TI_symbol_name("RAM_PE_SET")
    1564        .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1565        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1566        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1567        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1568        .dwattr $C$DW$120, DW_AT_decl_line(0xaa)
    1569        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1570$C$DW$121       .dwtag  DW_TAG_member
    1571        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1572        .dwattr $C$DW$121, DW_AT_name("rsvd20")
    1573        .dwattr $C$DW$121, DW_AT_TI_symbol_name("rsvd20")
    1574        .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1575        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   30

    1577        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1578        .dwattr $C$DW$121, DW_AT_decl_line(0xab)
    1579        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1580        .dwendtag $C$DW$T$26
    1581
    1582        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1583        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa5)
    1584        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1585$C$DW$T$127     .dwtag  DW_TAG_volatile_type
    1586        .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$26)
    1587
    1588$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1589        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1590$C$DW$122       .dwtag  DW_TAG_member
    1591        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1592        .dwattr $C$DW$122, DW_AT_name("PRU0_IMEM_PE_CLR")
    1593        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1594        .dwattr $C$DW$122, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1595        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1597        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1598        .dwattr $C$DW$122, DW_AT_decl_line(0xb5)
    1599        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1600$C$DW$123       .dwtag  DW_TAG_member
    1601        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1602        .dwattr $C$DW$123, DW_AT_name("PRU0_DMEM_PE_CLR")
    1603        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1604        .dwattr $C$DW$123, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1605        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1607        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1608        .dwattr $C$DW$123, DW_AT_decl_line(0xb6)
    1609        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1610$C$DW$124       .dwtag  DW_TAG_member
    1611        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1612        .dwattr $C$DW$124, DW_AT_name("PRU1_IMEM_PE_CLR")
    1613        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1614        .dwattr $C$DW$124, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1615        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1617        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1618        .dwattr $C$DW$124, DW_AT_decl_line(0xb7)
    1619        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1620$C$DW$125       .dwtag  DW_TAG_member
    1621        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1622        .dwattr $C$DW$125, DW_AT_name("PRU1_DMEM_PE_CLR")
    1623        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1624        .dwattr $C$DW$125, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1625        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1627        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1628        .dwattr $C$DW$125, DW_AT_decl_line(0xb8)
    1629        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1630$C$DW$126       .dwtag  DW_TAG_member
    1631        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   31

    1632        .dwattr $C$DW$126, DW_AT_name("rsvd16")
    1633        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd16")
    1634        .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1635        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1637        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1638        .dwattr $C$DW$126, DW_AT_decl_line(0xb9)
    1639        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1640        .dwendtag $C$DW$T$27
    1641
    1642        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1643        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb4)
    1644        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1645$C$DW$T$129     .dwtag  DW_TAG_volatile_type
    1646        .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$27)
    1647
    1648$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1649        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1650$C$DW$127       .dwtag  DW_TAG_member
    1651        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1652        .dwattr $C$DW$127, DW_AT_name("PMAO_PRU0")
    1653        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PMAO_PRU0")
    1654        .dwattr $C$DW$127, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1655        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1657        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1658        .dwattr $C$DW$127, DW_AT_decl_line(0xc6)
    1659        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1660$C$DW$128       .dwtag  DW_TAG_member
    1661        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1662        .dwattr $C$DW$128, DW_AT_name("PMAO_PRU1")
    1663        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PMAO_PRU1")
    1664        .dwattr $C$DW$128, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1665        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1667        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1668        .dwattr $C$DW$128, DW_AT_decl_line(0xc7)
    1669        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1670$C$DW$129       .dwtag  DW_TAG_member
    1671        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1672        .dwattr $C$DW$129, DW_AT_name("rsvd2")
    1673        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd2")
    1674        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1675        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1677        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1678        .dwattr $C$DW$129, DW_AT_decl_line(0xc8)
    1679        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1680        .dwendtag $C$DW$T$28
    1681
    1682        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1683        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc5)
    1684        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1685$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1686        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$28)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   32

    1687
    1688$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1689        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1690$C$DW$130       .dwtag  DW_TAG_member
    1691        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1692        .dwattr $C$DW$130, DW_AT_name("OCP_EN")
    1693        .dwattr $C$DW$130, DW_AT_TI_symbol_name("OCP_EN")
    1694        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1695        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1697        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1698        .dwattr $C$DW$130, DW_AT_decl_line(0xd5)
    1699        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1700$C$DW$131       .dwtag  DW_TAG_member
    1701        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1702        .dwattr $C$DW$131, DW_AT_name("rsvd1")
    1703        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd1")
    1704        .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1705        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1707        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1708        .dwattr $C$DW$131, DW_AT_decl_line(0xd6)
    1709        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1710        .dwendtag $C$DW$T$29
    1711
    1712        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1713        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd4)
    1714        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1715$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1716        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$29)
    1717
    1718$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1719        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1720$C$DW$132       .dwtag  DW_TAG_member
    1721        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1722        .dwattr $C$DW$132, DW_AT_name("PRU1_PAD_HP_EN")
    1723        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1724        .dwattr $C$DW$132, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1725        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1727        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1728        .dwattr $C$DW$132, DW_AT_decl_line(0xe0)
    1729        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1730$C$DW$133       .dwtag  DW_TAG_member
    1731        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1732        .dwattr $C$DW$133, DW_AT_name("XFR_SHIFT_EN")
    1733        .dwattr $C$DW$133, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1734        .dwattr $C$DW$133, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1735        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1737        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1738        .dwattr $C$DW$133, DW_AT_decl_line(0xe1)
    1739        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1740$C$DW$134       .dwtag  DW_TAG_member
    1741        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   33

    1742        .dwattr $C$DW$134, DW_AT_name("rsvd2")
    1743        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd2")
    1744        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1745        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1747        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1748        .dwattr $C$DW$134, DW_AT_decl_line(0xe2)
    1749        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1750        .dwendtag $C$DW$T$30
    1751
    1752        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1753        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdf)
    1754        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1755$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1756        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$30)
    1757
    1758$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1759        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1760$C$DW$135       .dwtag  DW_TAG_member
    1761        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1762        .dwattr $C$DW$135, DW_AT_name("PIN_MUX_SEL")
    1763        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1764        .dwattr $C$DW$135, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1765        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1767        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1768        .dwattr $C$DW$135, DW_AT_decl_line(0xee)
    1769        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1770$C$DW$136       .dwtag  DW_TAG_member
    1771        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1772        .dwattr $C$DW$136, DW_AT_name("PWM0_REMAP_EN")
    1773        .dwattr $C$DW$136, DW_AT_TI_symbol_name("PWM0_REMAP_EN")
    1774        .dwattr $C$DW$136, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1775        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1777        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1778        .dwattr $C$DW$136, DW_AT_decl_line(0xef)
    1779        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1780$C$DW$137       .dwtag  DW_TAG_member
    1781        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1782        .dwattr $C$DW$137, DW_AT_name("PWM3_REMAP_EN")
    1783        .dwattr $C$DW$137, DW_AT_TI_symbol_name("PWM3_REMAP_EN")
    1784        .dwattr $C$DW$137, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1785        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1787        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1788        .dwattr $C$DW$137, DW_AT_decl_line(0xf0)
    1789        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1790$C$DW$138       .dwtag  DW_TAG_member
    1791        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1792        .dwattr $C$DW$138, DW_AT_name("rsvd2")
    1793        .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd2")
    1794        .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1795        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   34

    1797        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1798        .dwattr $C$DW$138, DW_AT_decl_line(0xf1)
    1799        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1800        .dwendtag $C$DW$T$31
    1801
    1802        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1803        .dwattr $C$DW$T$31, DW_AT_decl_line(0xed)
    1804        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1805$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1806        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$31)
    1807
    1808$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1809        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1810$C$DW$139       .dwtag  DW_TAG_member
    1811        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$114)
    1812        .dwattr $C$DW$139, DW_AT_name("$P$T0")
    1813        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T0")
    1814        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1816        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1817        .dwattr $C$DW$139, DW_AT_decl_line(0x29)
    1818        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    1819$C$DW$140       .dwtag  DW_TAG_member
    1820        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$116)
    1821        .dwattr $C$DW$140, DW_AT_name("$P$T1")
    1822        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T1")
    1823        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1824        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1825        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1826        .dwattr $C$DW$140, DW_AT_decl_line(0x33)
    1827        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1828$C$DW$141       .dwtag  DW_TAG_member
    1829        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$118)
    1830        .dwattr $C$DW$141, DW_AT_name("$P$T2")
    1831        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T2")
    1832        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1833        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1834        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1835        .dwattr $C$DW$141, DW_AT_decl_line(0x41)
    1836        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1837$C$DW$142       .dwtag  DW_TAG_member
    1838        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$120)
    1839        .dwattr $C$DW$142, DW_AT_name("$P$T3")
    1840        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T3")
    1841        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1842        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1843        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1844        .dwattr $C$DW$142, DW_AT_decl_line(0x55)
    1845        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1846$C$DW$143       .dwtag  DW_TAG_member
    1847        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$122)
    1848        .dwattr $C$DW$143, DW_AT_name("$P$T4")
    1849        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T4")
    1850        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1851        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   35

    1852        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1853        .dwattr $C$DW$143, DW_AT_decl_line(0x69)
    1854        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1855$C$DW$144       .dwtag  DW_TAG_member
    1856        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$124)
    1857        .dwattr $C$DW$144, DW_AT_name("$P$T5")
    1858        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T5")
    1859        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1860        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1861        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1862        .dwattr $C$DW$144, DW_AT_decl_line(0x85)
    1863        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    1864$C$DW$145       .dwtag  DW_TAG_member
    1865        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$126)
    1866        .dwattr $C$DW$145, DW_AT_name("$P$T6")
    1867        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T6")
    1868        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1869        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1870        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1871        .dwattr $C$DW$145, DW_AT_decl_line(0x94)
    1872        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    1873$C$DW$146       .dwtag  DW_TAG_member
    1874        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$128)
    1875        .dwattr $C$DW$146, DW_AT_name("$P$T7")
    1876        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T7")
    1877        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1878        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1879        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1880        .dwattr $C$DW$146, DW_AT_decl_line(0xa2)
    1881        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    1882$C$DW$147       .dwtag  DW_TAG_member
    1883        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$130)
    1884        .dwattr $C$DW$147, DW_AT_name("$P$T8")
    1885        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T8")
    1886        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1887        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1888        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1889        .dwattr $C$DW$147, DW_AT_decl_line(0xb1)
    1890        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    1891$C$DW$148       .dwtag  DW_TAG_member
    1892        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
    1893        .dwattr $C$DW$148, DW_AT_name("rsvd24")
    1894        .dwattr $C$DW$148, DW_AT_TI_symbol_name("rsvd24")
    1895        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1896        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1897        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1898        .dwattr $C$DW$148, DW_AT_decl_line(0xbe)
    1899        .dwattr $C$DW$148, DW_AT_decl_column(0x0b)
    1900$C$DW$149       .dwtag  DW_TAG_member
    1901        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$132)
    1902        .dwattr $C$DW$149, DW_AT_name("$P$T9")
    1903        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T9")
    1904        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1905        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1906        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   36

    1907        .dwattr $C$DW$149, DW_AT_decl_line(0xc2)
    1908        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    1909$C$DW$150       .dwtag  DW_TAG_member
    1910        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$33)
    1911        .dwattr $C$DW$150, DW_AT_name("rsvd2c")
    1912        .dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd2c")
    1913        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1914        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1915        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1916        .dwattr $C$DW$150, DW_AT_decl_line(0xcd)
    1917        .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    1918$C$DW$151       .dwtag  DW_TAG_member
    1919        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$134)
    1920        .dwattr $C$DW$151, DW_AT_name("$P$T10")
    1921        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T10")
    1922        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1923        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1924        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1925        .dwattr $C$DW$151, DW_AT_decl_line(0xd1)
    1926        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    1927$C$DW$152       .dwtag  DW_TAG_member
    1928        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$136)
    1929        .dwattr $C$DW$152, DW_AT_name("$P$T11")
    1930        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T11")
    1931        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1932        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1933        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1934        .dwattr $C$DW$152, DW_AT_decl_line(0xdc)
    1935        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    1936$C$DW$153       .dwtag  DW_TAG_member
    1937        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$34)
    1938        .dwattr $C$DW$153, DW_AT_name("rsvd38")
    1939        .dwattr $C$DW$153, DW_AT_TI_symbol_name("rsvd38")
    1940        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1941        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1942        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1943        .dwattr $C$DW$153, DW_AT_decl_line(0xe7)
    1944        .dwattr $C$DW$153, DW_AT_decl_column(0x0b)
    1945$C$DW$154       .dwtag  DW_TAG_member
    1946        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$138)
    1947        .dwattr $C$DW$154, DW_AT_name("$P$T12")
    1948        .dwattr $C$DW$154, DW_AT_TI_symbol_name("$P$T12")
    1949        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1950        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1951        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    1952        .dwattr $C$DW$154, DW_AT_decl_line(0xea)
    1953        .dwattr $C$DW$154, DW_AT_decl_column(0x02)
    1954        .dwendtag $C$DW$T$35
    1955
    1956        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    1957        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1958        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1959$C$DW$T$294     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1960        .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$35)
    1961        .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   37

    1962        .dwattr $C$DW$T$294, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_
    1963        .dwattr $C$DW$T$294, DW_AT_decl_line(0xf4)
    1964        .dwattr $C$DW$T$294, DW_AT_decl_column(0x03)
    1965$C$DW$T$295     .dwtag  DW_TAG_volatile_type
    1966        .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$294)
    1967
    1968$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1969        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1970$C$DW$155       .dwtag  DW_TAG_member
    1971        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$36)
    1972        .dwattr $C$DW$155, DW_AT_name("type")
    1973        .dwattr $C$DW$155, DW_AT_TI_symbol_name("type")
    1974        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1976        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    1977        .dwattr $C$DW$155, DW_AT_decl_line(0x177)
    1978        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    1979$C$DW$156       .dwtag  DW_TAG_member
    1980        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$36)
    1981        .dwattr $C$DW$156, DW_AT_name("ver")
    1982        .dwattr $C$DW$156, DW_AT_TI_symbol_name("ver")
    1983        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1984        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1985        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_types
    1986        .dwattr $C$DW$156, DW_AT_decl_line(0x178)
    1987        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    1988        .dwendtag $C$DW$T$37
    1989
    1990        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/rsc_type
    1991        .dwattr $C$DW$T$37, DW_AT_decl_line(0x176)
    1992        .dwattr $C$DW$T$37, DW_AT_decl_column(0x0a)
    1993
    1994$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1995        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1996$C$DW$157       .dwtag  DW_TAG_member
    1997        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
    1998        .dwattr $C$DW$157, DW_AT_name("REVISION")
    1999        .dwattr $C$DW$157, DW_AT_TI_symbol_name("REVISION")
    2000        .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    2001        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2003        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2004        .dwattr $C$DW$157, DW_AT_decl_line(0x2d)
    2005        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2006        .dwendtag $C$DW$T$38
    2007
    2008        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    2009        .dwattr $C$DW$T$38, DW_AT_decl_line(0x2c)
    2010        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2011$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    2012        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$38)
    2013
    2014$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2015        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2016$C$DW$158       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   38

    2017        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
    2018        .dwattr $C$DW$158, DW_AT_name("rsvd0")
    2019        .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd0")
    2020        .dwattr $C$DW$158, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2021        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2023        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2024        .dwattr $C$DW$158, DW_AT_decl_line(0x36)
    2025        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2026$C$DW$159       .dwtag  DW_TAG_member
    2027        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
    2028        .dwattr $C$DW$159, DW_AT_name("WAKEUP_MODE")
    2029        .dwattr $C$DW$159, DW_AT_TI_symbol_name("WAKEUP_MODE")
    2030        .dwattr $C$DW$159, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    2031        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2033        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2034        .dwattr $C$DW$159, DW_AT_decl_line(0x37)
    2035        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2036$C$DW$160       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$32)
    2038        .dwattr $C$DW$160, DW_AT_name("NEST_MODE")
    2039        .dwattr $C$DW$160, DW_AT_TI_symbol_name("NEST_MODE")
    2040        .dwattr $C$DW$160, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2041        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2044        .dwattr $C$DW$160, DW_AT_decl_line(0x38)
    2045        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2046$C$DW$161       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    2048        .dwattr $C$DW$161, DW_AT_name("PRIORITY_HOLD_MODE")
    2049        .dwattr $C$DW$161, DW_AT_TI_symbol_name("PRIORITY_HOLD_MODE")
    2050        .dwattr $C$DW$161, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    2051        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2053        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2054        .dwattr $C$DW$161, DW_AT_decl_line(0x39)
    2055        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2056$C$DW$162       .dwtag  DW_TAG_member
    2057        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
    2058        .dwattr $C$DW$162, DW_AT_name("rsvd5")
    2059        .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd5")
    2060        .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1b)
    2061        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2063        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2064        .dwattr $C$DW$162, DW_AT_decl_line(0x3a)
    2065        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2066        .dwendtag $C$DW$T$39
    2067
    2068        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    2069        .dwattr $C$DW$T$39, DW_AT_decl_line(0x35)
    2070        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2071$C$DW$T$142     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   39

    2072        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$39)
    2073
    2074$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2075        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2076$C$DW$163       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
    2078        .dwattr $C$DW$163, DW_AT_name("ENABLE_HINT_ANY")
    2079        .dwattr $C$DW$163, DW_AT_TI_symbol_name("ENABLE_HINT_ANY")
    2080        .dwattr $C$DW$163, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2081        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2083        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2084        .dwattr $C$DW$163, DW_AT_decl_line(0x45)
    2085        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2086$C$DW$164       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$32)
    2088        .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2089        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd1")
    2090        .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2091        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2093        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2094        .dwattr $C$DW$164, DW_AT_decl_line(0x46)
    2095        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2096        .dwendtag $C$DW$T$40
    2097
    2098        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    2099        .dwattr $C$DW$T$40, DW_AT_decl_line(0x44)
    2100        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2101$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    2102        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$40)
    2103
    2104$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2105        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2106$C$DW$165       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$32)
    2108        .dwattr $C$DW$165, DW_AT_name("GLB_NEST_LEVEL")
    2109        .dwattr $C$DW$165, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2110        .dwattr $C$DW$165, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2111        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2113        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2114        .dwattr $C$DW$165, DW_AT_decl_line(0x51)
    2115        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2116$C$DW$166       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
    2118        .dwattr $C$DW$166, DW_AT_name("rsvd9")
    2119        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd9")
    2120        .dwattr $C$DW$166, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2121        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2123        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2124        .dwattr $C$DW$166, DW_AT_decl_line(0x52)
    2125        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2126$C$DW$167       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Sat Jul  3 21:31:23 2021

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/home/debian/BBAI-SHARED-MEM/pru_codes/tmp/main.asm                  PAGE   40

    2127        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2128        .dwattr $C$DW$167, DW_AT_name("AUTO_OVERRIDE")
    2129        .dwattr $C$DW$167, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2130        .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2131        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2133        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2134        .dwattr $C$DW$167, DW_AT_decl_line(0x53)
    2135        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2136        .dwendtag $C$DW$T$41
    2137
    2138        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    2139        .dwattr $C$DW$T$41, DW_AT_decl_line(0x50)
    2140        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2141$C$DW$T$146     .dwtag  DW_TAG_volatile_type
    2142        .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$41)
    2143
    2144$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2145        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2146$C$DW$168       .dwtag  DW_TAG_member
    2147        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    2148        .dwattr $C$DW$168, DW_AT_name("STATUS_SET_INDEX")
    2149        .dwattr $C$DW$168, DW_AT_TI_symbol_name("STATUS_SET_INDEX")
    2150        .dwattr $C$DW$168, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2151        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2153        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2154        .dwattr $C$DW$168, DW_AT_decl_line(0x5c)
    2155        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2156$C$DW$169       .dwtag  DW_TAG_member
    2157        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2158        .dwattr $C$DW$169, DW_AT_name("rsvd10")
    2159        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd10")
    2160        .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2161        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2163        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2_
    2164        .dwattr $C$DW$169, DW_AT_decl_line(0x5d)
    2165        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2166        .dwendtag $C$DW$T$42
    2167
    2168        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am572x_2
    2169        .dwattr $C$DW$T$42, DW_AT_decl_line(0x5b)
    2170        .dwattr $C$DW$T$42, DW_AT_decl_column(0x13)
    2171$C$DW$T$148     .dwtag  DW_TAG_volatile_type
    2172        .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$42)
    2173
    2174$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2175        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2176$C$DW$170       .dwtag  DW_TAG_member
    2177        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$32)
    2178        .dwattr $C$DW$170, DW_AT_name("STATUS_CLR_INDEX")
    2179        .dwattr $C$DW$170, DW_AT_TI_symbol_name("STATUS_CLR_INDEX")
    2180        .dwattr $C$DW$170, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
